entries/archive.org
#+hugo_base_dir: ../
#+startup: content
#+macro: latex @@html:<span class="latex">L<sup>A</sup>T<sub>E</sub>X</span>@@
#+options: ^:{}
#+macro: srclink (eval (org-hugo-get-link-to-orgfile "https://github.com/takaxp/blog/blame/master/entries/" "see Orgfile"))

** DONE Hugo の data ディレクトリ                                     :@hugo:
   CLOSED: [2018-08-25 Sat 04:11]
:PROPERTIES:
:EXPORT_FILE_NAME: 62d73d4b-439b-cf74-1bf3-ecae75bd7bd2
:EXPORT_HUGO_LASTMOD: 
:CREATED:  [2018-08-25 Sat 03:54]
:END:

環境構築がほぼ完了．基本的な処理フローは？と言えば，「書いて，デプロイ」のホント2ステップだけ．

1. Emacs Org Mode でメモを取るように書く（org-capture経由もOK）
2. deploy スクリプトを走らせる（サーバにrsyncしたり，GitHubにpush）

以上，楽すぎた．ありがとう [[https://orgmode.org][Org Mode]]，[[https://gohugo.io/][Hugo]]，[[https://ox-hugo.scripter.co/][ox-hugo]] たち！

さて，Hugoさん， =data= 以下にいわゆるプロセッシング対象のデータを =json= 形式で配置すると，[[https://gohugo.io/content-management/shortcodes/][shortcodes]] で色々と楽しめるのね．これって，ちょっと工夫すれば，料理のレシピ管理に使えるよという話かなと．なお保存方法は =json= 以外に， =yaml=, =toml= もOK．

{{< youtube id="FyPgSuwIMWQ" class="my-yt" >}}

で，Go, Json, SQLite でざっくり調べると，なかなに面白い情報があって，これはテンション上がる．

*** References
 - [[https://gohugo.io/templates/data-templates/][Data Templates | Hugo]]
 - [[https://stackoverflow.com/questions/48534992/json-fields-from-sqlite3-in-golang][sqlite - JSON fields from sqlite3 in golang - Stack Overflow]]
