content/2018/62d73d4b-439b-cf74-1bf3-ecae75bd7bd2.md
+++
title = "Hugo の data ディレクトリ"
author = ["Takaaki ISHIKAWA"]
date = 2018-08-25T04:11:00+09:00
tags = ["hugo"]
categories = ["tech"]
draft = false
+++

環境構築がほぼ完了．基本的な処理フローは？と言えば，「書いて，デプロイ」のホント2ステップだけ．

1.  Emacs Org Mode でメモを取るように書く（org-capture経由もOK）
2.  deploy スクリプトを走らせる（サーバにrsyncしたり，GitHubにpush）

以上，楽すぎた．ありがとう [Org Mode](https://orgmode.org)，[Hugo](https://gohugo.io/)，[ox-hugo](https://ox-hugo.scripter.co/) たち！

さて，Hugoさん， `data` 以下にいわゆるプロセッシング対象のデータを `json` 形式で配置すると，[shortcodes](https://gohugo.io/content-management/shortcodes/) で色々と楽しめるのね．これって，ちょっと工夫すれば，料理のレシピ管理に使えるよという話かなと．なお保存方法は `json` 以外に， `yaml`, `toml` もOK．

{{< youtube id="FyPgSuwIMWQ" class="my-yt" >}}

で，Go, Json, SQLite でざっくり調べると，なかなに面白い情報があって，これはテンション上がる．


## References {#references}

-   [Data Templates | Hugo](https://gohugo.io/templates/data-templates/)
-   [sqlite - JSON fields from sqlite3 in golang - Stack Overflow](https://stackoverflow.com/questions/48534992/json-fields-from-sqlite3-in-golang)
